---
kind: type
id: T:Autodesk.Revit.UI.TabbedDialogExtension
source: html/06ae60a6-3fbe-c334-ee00-ae9628e2169a.htm
---
# Autodesk.Revit.UI.TabbedDialogExtension

Contains the information required to create and implement the behavior for the new tab inside
the Revit options dialog.

## Syntax (C#)
```csharp
public class TabbedDialogExtension
```

## Remarks
Each page has an associated user interface control and the handlers of buttons Cancel, Restore Defaults
and help can optionally be set. The size of the control is limited to 305 (height) x 288 (width) in physical pixels.